--------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/hst17anwe/Documents/nylabbar/Graduate_econ/Lab_3/logfile_lab
> 3.log
  log type:  text
 opened on:  21 Nov 2023, 14:09:46

. use RDD_data_MLDA_deaths.dta

. 
. 
. * Producing some summary statistics and plots over our data.
. summarize

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
age_in_years |         50        20.5    1.111168         19         22
     agecell |         50          21    1.126957   19.06849   22.93151
         all |         48    95.67272    3.831062   88.42776   105.2683
    internal |         48    20.28529    2.253907   15.97709   24.37291
    external |         48    75.38743    2.986008   71.34142   83.33099

. 
. codebook , c

Variable      Obs Unique      Mean       Min       Max  Label
--------------------------------------------------------------------------------
age_in_years   50      4      20.5        19        22  
agecell        50     50        21  19.06849  22.93151  Age Cell
all            48     48  95.67272  88.42776  105.2683  Mortality rate from a...
internal       48     48  20.28529  15.97709  24.37291  Internal
external       48     48  75.38743  71.34142  83.33099  External
--------------------------------------------------------------------------------

. line all external internal agecell, legend(size(medsmall))

.  
. 
. 
. * Recentering our running variable by subtracting 21.
. 
. gen recentered_age = agecell - 21

. 
. scatter recentered_age all

. 
. 
. * Generating a dummy variable (treatment) that takes the value of 1 if the per
> son is permitted to drink.
. gen treatment = 1 if recentered_age >= 0
(25 missing values generated)

. replace treatment = 0 if missing(treatment)
(25 real changes made)

. 
. * Regressing treatment on external causes of death, and then on internal cause
> s of death.
. reg external treatment recentered_age

      Source |       SS           df       MS      Number of obs   =        48
-------------+----------------------------------   F(2, 45)        =     13.99
       Model |  160.653741         2  80.3268705   Prob > F        =    0.0000
    Residual |  258.409628        45  5.74243617   R-squared       =    0.3834
-------------+----------------------------------   Adj R-squared   =    0.3560
       Total |  419.063369        47  8.91624189   Root MSE        =    2.3963

-------------------------------------------------------------------------------
     external | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
    treatment |   7.270792   1.384428     5.25   0.000     4.482411    10.05917
recentered_~e |  -2.574752    .607933    -4.24   0.000    -3.799192   -1.350312
        _cons |   71.75204   .7738181    92.72   0.000     70.19349    73.31059
-------------------------------------------------------------------------------

. reg internal treatment recentered_age

      Source |       SS           df       MS      Number of obs   =        48
-------------+----------------------------------   F(2, 45)        =     89.64
       Model |  190.857614         2  95.4288068   Prob > F        =    0.0000
    Residual |  47.9069341        45  1.06459854   R-squared       =    0.7994
-------------+----------------------------------   Adj R-squared   =    0.7904
       Total |  238.764548        47  5.08009676   Root MSE        =    1.0318

-------------------------------------------------------------------------------
     internal | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
    treatment |   .3919185   .5960948     0.66   0.514     -.808678    1.592515
recentered_~e |   1.600067   .2617584     6.11   0.000     1.072859    2.127275
        _cons |   20.08933   .3331837    60.30   0.000     19.41826     20.7604
-------------------------------------------------------------------------------

. 
. * Performing the same regressions as above but with reduced bandwidth.
. reg external treatment recentered_age if recentered_age > -1 & recentered_age 
> < 1

      Source |       SS           df       MS      Number of obs   =        24
-------------+----------------------------------   F(2, 21)        =     15.53
       Model |  162.008955         2  81.0044773   Prob > F        =    0.0001
    Residual |  109.516501        21  5.21507149   R-squared       =    0.5967
-------------+----------------------------------   Adj R-squared   =    0.5582
       Total |  271.525456        23  11.8054546   Root MSE        =    2.2837

-------------------------------------------------------------------------------
     external | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
    treatment |   8.061051   1.869478     4.31   0.000      4.17326    11.94884
recentered_~e |   -3.24684   1.642928    -1.98   0.061    -6.663495    .1698159
        _cons |   72.22433   1.044524    69.15   0.000     70.05212    74.39653
-------------------------------------------------------------------------------

. reg internal treatment recentered_age if recentered_age > -1 & recentered_age 
> < 1

      Source |       SS           df       MS      Number of obs   =        24
-------------+----------------------------------   F(2, 21)        =     10.24
       Model |  16.9945615         2  8.49728073   Prob > F        =    0.0008
    Residual |   17.417876        21  .829422667   R-squared       =    0.4938
-------------+----------------------------------   Adj R-squared   =    0.4456
       Total |  34.4124375        23  1.49619293   Root MSE        =    .91073

-------------------------------------------------------------------------------
     internal | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
    treatment |   1.692263   .7455522     2.27   0.034     .1418018    3.242723
recentered_~e |  -.0094185   .6552036    -0.01   0.989    -1.371989    1.353152
        _cons |    19.4887   .4165589    46.78   0.000     18.62241    20.35498
-------------------------------------------------------------------------------

. 
. * Question 10
. gen treatment_age = treatment * recentered_age

. reg external treatment recentered_age treatment_age

      Source |       SS           df       MS      Number of obs   =        48
-------------+----------------------------------   F(3, 44)        =     14.74
       Model |  210.077924         3  70.0259746   Prob > F        =    0.0000
    Residual |  208.985445        44   4.7496692   R-squared       =    0.5013
-------------+----------------------------------   Adj R-squared   =    0.4673
       Total |  419.063369        47  8.91624189   Root MSE        =    2.1794

-------------------------------------------------------------------------------
     external | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
    treatment |   7.270792   1.259082     5.77   0.000     4.733279    9.808306
recentered_~e |  -.7912345   .7819055    -1.01   0.317    -2.367062    .7845926
treatment_age |  -3.567035   1.105781    -3.23   0.002    -5.795591   -1.338479
        _cons |   73.51112   .8903055    82.57   0.000     71.71683    75.30542
-------------------------------------------------------------------------------

. reg internal treatment recentered_age treatment_age

      Source |       SS           df       MS      Number of obs   =        48
-------------+----------------------------------   F(3, 44)        =     58.44
       Model |   190.86274         3  63.6209132   Prob > F        =    0.0000
    Residual |  47.9018082        44  1.08867746   R-squared       =    0.7994
-------------+----------------------------------   Adj R-squared   =    0.7857
       Total |  238.764548        47  5.08009676   Root MSE        =    1.0434

-------------------------------------------------------------------------------
     internal | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
    treatment |   .3919185   .6027983     0.65   0.519    -.8229416    1.606779
recentered_~e |    1.61823   .3743452     4.32   0.000     .8637869    2.372673
treatment_age |  -.0363262    .529404    -0.07   0.946     -1.10327    1.030617
        _cons |   20.10725   .4262427    47.17   0.000     19.24821    20.96628
-------------------------------------------------------------------------------

. 
. * Saving our new data and closing the logfile. 
. save OUTPUT_part1_data, replace
file OUTPUT_part1_data.dta saved

. log close
      name:  <unnamed>
       log:  /Users/hst17anwe/Documents/nylabbar/Graduate_econ/Lab_3/logfile_lab
> 3.log
  log type:  text
 closed on:  21 Nov 2023, 14:09:49
--------------------------------------------------------------------------------
