-------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/vladdavid/Documents/Graduate_econometrics/Labbar/Graduate_econ/Lab_3/logfile_lab3.log
  log type:  text
<<<<<<< HEAD
 opened on:  22 Nov 2023, 00:47:31
=======
 opened on:  21 Nov 2023, 14:37:37
>>>>>>> 12b4a80d8388ddf573f3143c589328546b492514

. use DID_deaths.dta

. 
<<<<<<< HEAD
. * Question 1
. summarize
=======
. 
. * Generating a variable for States where the 
. gen legal = 1 if state_name == "Alabama" &  year >= 1975
(23 missing values generated)
>>>>>>> 12b4a80d8388ddf573f3143c589328546b492514

. replace legal = 0 if missing(legal)
(23 real changes made)

. 
<<<<<<< HEAD
. twoway (line all external internal agecell), ytitle("Mortality rate") xtitle("Age cell")legend(size(medsmall))

. 
. ytitle("Mortality rate") xtitle("Year") legend(order(1 "Arkansas" 2 "Alabama"))
command ytitle is unrecognized
r(199);

end of do-file

r(199);

=======
. 
. * Saving our new data and closing the logfile. 
. save OUTPUT_part2_data, replace
file OUTPUT_part2_data.dta saved

. log close
      name:  <unnamed>
       log:  /Users/hst17anwe/Documents/nylabbar/Graduate_econ/Lab_3/logfile_lab
> 3.log
  log type:  text
 closed on:  21 Nov 2023, 14:37:37
--------------------------------------------------------------------------------
>>>>>>> 12b4a80d8388ddf573f3143c589328546b492514
