-------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/vladdavid/Documents/Graduate_econometrics/Labbar/Graduate_econ/Lab_3/logfile_lab3.log
  log type:  text
 opened on:  22 Nov 2023, 22:33:40

. use DID_deaths.dta

. 
. gen legal = 1 if state_name == "Alabama" && year >= 1975 
(23 missing values generated)

. replace legal = 0 if missing(legal)
(23 real changes made)

. 
. // Question 15
. gen alabama = mrate if state_name == "Alabama"
(18 missing values generated)

. gen arkansas = mrate if state_name == "Arkansas"
(18 missing values generated)

. 
. twoway (scatter arkansas alabama year) (line arkansas year, lpattern(dash)) (line alabama year, lpattern(dash)), xline(1975) ytitle("Mort
> ality rate") xtitle("Year") legend(order(1 "Arkansas" 2 "Alabama"))

. 
. * Question 16 Förslag på lösning
. gen year_dummy = 1 if year >= 1975
(10 missing values generated)

. replace year_dummy = 0 if missing(year_dummy)
(10 real changes made)

. gen state_dummy = 1 if state_name == "Alabama"
(18 missing values generated)

. replace state_dummy = 0 if missing(state_dummy)
(18 real changes made)

. 
. gen did = state_dummy * year_dummy

. reg mrate year_dummy state_dummy did

      Source |       SS           df       MS      Number of obs   =        36
-------------+----------------------------------   F(3, 32)        =     43.64
       Model |  3896.89812         3  1298.96604   Prob > F        =    0.0000
    Residual |  952.559167        32   29.767474   R-squared       =    0.8036
-------------+----------------------------------   Adj R-squared   =    0.7852
       Total |  4849.45729        35  138.555922   Root MSE        =     5.456

------------------------------------------------------------------------------
       mrate | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
  year_dummy |  -14.37324   2.871115    -5.01   0.000    -20.22151   -8.524967
 state_dummy |   11.12956   3.450651     3.23   0.003      4.10081     18.1583
         did |    10.2427    4.06037     2.52   0.017     1.972001    18.51341
       _cons |    26.8037   2.439978    10.99   0.000     21.83362    31.77377
------------------------------------------------------------------------------

. 
. 
. 
. *Question 17
. twoway (function y = -2*x + 37, range(-1 0) lcolor(blue)) || (function y = -2*x + 26, range(-1 0) lcolor(red))  (function y = -3.5*x + 37
> , range(0 1) lcolor(blue))  (function y = -14.4*x + 26, range(0 1) lcolor(red)) , xline(0, lpattern(dash) lcolor(grey)) xlabel(-1 "Pre"  
> 0 "Policy change in 1975 Intervention State" 1 "Post") legend(rows(2) order(1 "Mortality Alabama (Ext. causes)" 2 "Mortality Arkansas (Ex
> t. causes)")) ytitle("Mortality Internal Causes (by 100.000)") xtitle("")
(note:  named style grey not found in class color, default attributes used)

. 
. 
. 
. * Saving our new data and closing the logfile. 
. save OUTPUT_part2_data, replace
file OUTPUT_part2_data.dta saved

. log close
      name:  <unnamed>
       log:  /Users/vladdavid/Documents/Graduate_econometrics/Labbar/Graduate_econ/Lab_3/logfile_lab3.log
  log type:  text
 closed on:  22 Nov 2023, 22:33:45
-------------------------------------------------------------------------------------------------------------------------------------------
