-------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/vladdavid/Documents/Graduate_econometrics/Labbar/Graduate_econ/Lab_2/logfile_lab1.log
  log type:  text
 opened on:  19 Nov 2023, 21:50:59

. use exam_results.dta

. 
. * Question 1)
. * Reading the data and producing some summary statistics.
. summarize

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        name |          0
         age |        500      24.436      5.0996         17         56
  test_score |        500       58.13     10.4395         36         89
hours_stud~d |        500      48.506    3.273438         38         56
most_lectu~s |          0
-------------+---------------------------------------------------------
        pass |        500        .714    .4523419          0          1
 distinction |        500        .118    .3229312          0          1
        fail |        500        .168    .3742407          0          1

. codebook, compact

Variable      Obs Unique    Mean  Min  Max  Label
-------------------------------------------------------------------------------------------------------------------------------------------
name          500    500       .    .    .  
age           500     26  24.436   17   56  
test_score    500     52   58.13   36   89  
hours_stud~d  500     19  48.506   38   56  
most_lectu~s  500      2       .    .    .  
pass          500      2    .714    0    1  
distinction   500      2    .118    0    1  
fail          500      2    .168    0    1  
-------------------------------------------------------------------------------------------------------------------------------------------

. 
. * Question 2)
. * Plotting test score against hours studied and calculating correlation. 
. scatter test_score hours_studied

. correlate test_score hours_studied
(obs=500)

             | test_s~e hours_~d
-------------+------------------
  test_score |   1.0000
hours_stud~d |  -0.1121   1.0000


. 
. * Question 3)
. * Estimating an OLS regression with test score as dependent variable and hours studied as independent variable
. reg test_score hours_studied

      Source |       SS           df       MS      Number of obs   =       500
-------------+----------------------------------   F(1, 498)       =      6.34
       Model |  683.623654         1  683.623654   Prob > F        =    0.0121
    Residual |  53698.9263       498  107.829169   R-squared       =    0.0126
-------------+----------------------------------   Adj R-squared   =    0.0106
       Total |    54382.55       499  108.983066   Root MSE        =    10.384

-------------------------------------------------------------------------------
   test_score | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
hours_studied |  -.3575643   .1420083    -2.52   0.012    -.6365736   -.0785551
        _cons |   75.47402   6.903892    10.93   0.000     61.90967    89.03836
-------------------------------------------------------------------------------

. 
. * Question 4)
. * Testing our null hypotheses at 10% and 1% significance level respectively. For significance level 5%, please refer to the regression in
>  question 3
. reg test_score hours_studied ,level(90)

      Source |       SS           df       MS      Number of obs   =       500
-------------+----------------------------------   F(1, 498)       =      6.34
       Model |  683.623654         1  683.623654   Prob > F        =    0.0121
    Residual |  53698.9263       498  107.829169   R-squared       =    0.0126
-------------+----------------------------------   Adj R-squared   =    0.0106
       Total |    54382.55       499  108.983066   Root MSE        =    10.384

-------------------------------------------------------------------------------
   test_score | Coefficient  Std. err.      t    P>|t|     [90% conf. interval]
--------------+----------------------------------------------------------------
hours_studied |  -.3575643   .1420083    -2.52   0.012    -.5915825   -.1235461
        _cons |   75.47402   6.903892    10.93   0.000     64.09696    86.85107
-------------------------------------------------------------------------------

. reg test_score hours_studied ,level(99)

      Source |       SS           df       MS      Number of obs   =       500
-------------+----------------------------------   F(1, 498)       =      6.34
       Model |  683.623654         1  683.623654   Prob > F        =    0.0121
    Residual |  53698.9263       498  107.829169   R-squared       =    0.0126
-------------+----------------------------------   Adj R-squared   =    0.0106
       Total |    54382.55       499  108.983066   Root MSE        =    10.384

-------------------------------------------------------------------------------
   test_score | Coefficient  Std. err.      t    P>|t|     [99% conf. interval]
--------------+----------------------------------------------------------------
hours_studied |  -.3575643   .1420083    -2.52   0.012    -.7247606    .0096319
        _cons |   75.47402   6.903892    10.93   0.000     57.62236    93.32567
-------------------------------------------------------------------------------

. 
. *Question 5)
. * Storing the values of the residuals and plotting them against hours studied. 
. reg test_score hours_studied

      Source |       SS           df       MS      Number of obs   =       500
-------------+----------------------------------   F(1, 498)       =      6.34
       Model |  683.623654         1  683.623654   Prob > F        =    0.0121
    Residual |  53698.9263       498  107.829169   R-squared       =    0.0126
-------------+----------------------------------   Adj R-squared   =    0.0106
       Total |    54382.55       499  108.983066   Root MSE        =    10.384

-------------------------------------------------------------------------------
   test_score | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
hours_studied |  -.3575643   .1420083    -2.52   0.012    -.6365736   -.0785551
        _cons |   75.47402   6.903892    10.93   0.000     61.90967    89.03836
-------------------------------------------------------------------------------

. predict U_hat, residuals

. scatter U_hat hours_studied, yline(0)

. 
. * Changing to a robust regression to deal with heteroscedasticity
. rreg test_score hours_studied

   Huber iteration 1:  maximum difference in weights = .63886013
   Huber iteration 2:  maximum difference in weights = .14326249
   Huber iteration 3:  maximum difference in weights = .04742773
Biweight iteration 4:  maximum difference in weights = .25644919
Biweight iteration 5:  maximum difference in weights = .01949724
Biweight iteration 6:  maximum difference in weights = .01405616
Biweight iteration 7:  maximum difference in weights = .0097372

Robust regression                               Number of obs     =        500
                                                F(  1,       498) =       0.87
                                                Prob > F          =     0.3524

-------------------------------------------------------------------------------
   test_score | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
hours_studied |  -.1223525   .1314496    -0.93   0.352    -.3806166    .1359116
        _cons |   62.47163   6.390567     9.78   0.000     49.91583    75.02742
-------------------------------------------------------------------------------

. predict Y_hat, residuals

. scatter Y_hat hours_studied, yline(0)

. 
. * Question 6)
. * Creating categorical variable and re-running the regression with this new variable. 
. recode hours_studied (38/43 = 0 "little studying") (44/50 = 1 "normal studying") (51/56 = 2 "heavy studying"), generate(hours_studied_cat
> )
(500 differences between hours_studied and hours_studied_cat)

. 
. reg test_score i.hours_studied_cat

      Source |       SS           df       MS      Number of obs   =       500
-------------+----------------------------------   F(2, 497)       =      2.01
       Model |  435.948872         2  217.974436   Prob > F        =    0.1353
    Residual |  53946.6011       497  108.544469   R-squared       =    0.0080
-------------+----------------------------------   Adj R-squared   =    0.0040
       Total |    54382.55       499  108.983066   Root MSE        =    10.418

-----------------------------------------------------------------------------------
       test_score | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
------------------+----------------------------------------------------------------
hours_studied_cat |
 normal studying  |  -3.139826   1.900346    -1.65   0.099    -6.873529    .5938776
  heavy studying  |  -4.064569   2.030809    -2.00   0.046    -8.054597   -.0745403
                  |
            _cons |   61.30303   1.813622    33.80   0.000     57.73972    64.86634
-----------------------------------------------------------------------------------

. 
. * Question 8)
. * Creating a dummy variable for "most_lectures" and then regressing test score on hours study and this new dummy variable. 
. generate most_lectures_dummy = 1 if most_lectures == "Yes"
(272 missing values generated)

. replace most_lectures_dummy = 0 if missing(most_lectures_dummy)
(272 real changes made)

. 
. reg test_score hours_studied most_lectures_dummy

      Source |       SS           df       MS      Number of obs   =       500
-------------+----------------------------------   F(2, 497)       =     10.98
       Model |  2300.86611         2  1150.43306   Prob > F        =    0.0000
    Residual |  52081.6839       497   104.79212   R-squared       =    0.0423
-------------+----------------------------------   Adj R-squared   =    0.0385
       Total |    54382.55       499  108.983066   Root MSE        =    10.237

-------------------------------------------------------------------------------------
         test_score | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------------+----------------------------------------------------------------
      hours_studied |  -.1526234   .1493984    -1.02   0.307    -.4461537    .1409069
most_lectures_dummy |   3.853512   .9809197     3.93   0.000     1.926251    5.780773
              _cons |   63.77595   7.428886     8.58   0.000     49.18005    78.37184
-------------------------------------------------------------------------------------

. 
. //estat endog test_score hours_studied most_lectures
. 
. * Saving our new data and closing the logfile. 
. save OUTPUT_part1_data, replace
file OUTPUT_part1_data.dta saved

. log close
      name:  <unnamed>
       log:  /Users/vladdavid/Documents/Graduate_econometrics/Labbar/Graduate_econ/Lab_2/logfile_lab1.log
  log type:  text
 closed on:  19 Nov 2023, 21:51:04
-------------------------------------------------------------------------------------------------------------------------------------------
