--------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/hst17anwe/Documents/gradstata/Graduate_econ/Lab_2/logfile_la
> b2.log
  log type:  text
 opened on:  13 Nov 2023, 11:15:20

. 
. * Reading the data
. use colonial_legacy.dta

. 
. * Creating a macro for our control variables
. local controls child_age_cont child_age_cont2 b4 hv007 hv025 elev LATNUM LONGN
> UM mean_temp mean_rain land_suit malaria_ecology tsi_grid_tsi atlantic_all_yea
> rs dist_missions

. 
. * Regressing vaccination index on times visit prospect and our control variabl
> es
. reg vaccination_index Times_Prospected `controls', cluster(cluster_id)

Linear regression                               Number of obs     =     12,139
                                                F(16, 840)        =      65.54
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3605
                                                Root MSE          =     .33225

                            (Std. err. adjusted for 841 clusters in cluster_id)
-------------------------------------------------------------------------------
              |               Robust
vaccination~x | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
Times_Prosp~d |  -.0683208   .0034923   -19.56   0.000    -.0751755   -.0614662
child_age_c~t |   .0625961   .0167269     3.74   0.000     .0297647    .0954275
child_age_c~2 |  -.0107277   .0071062    -1.51   0.132    -.0246757    .0032204
           b4 |   .0141816   .0063068     2.25   0.025     .0018026    .0265606
        hv007 |    .005346   .0026653     2.01   0.045     .0001146    .0105773
        hv025 |  -.0243657   .0209925    -1.16   0.246    -.0655696    .0168382
         elev |   .0001465   .0001077     1.36   0.174     -.000065     .000358
       LATNUM |    -.04525     .00932    -4.86   0.000    -.0635432   -.0269568
      LONGNUM |  -.0437315   .0128904    -3.39   0.001    -.0690328   -.0184303
    mean_temp |  -.0245103   .0184866    -1.33   0.185    -.0607957    .0117752
    mean_rain |  -.0013292   .0003471    -3.83   0.000    -.0020105   -.0006479
    land_suit |  -.0419906   .0468017    -0.90   0.370    -.1338527    .0498714
malaria_eco~y |   .0099298   .0030432     3.26   0.001     .0039566     .015903
 tsi_grid_tsi |  -.0906259   .0202455    -4.48   0.000    -.1303636   -.0508883
atlantic_al~s |  -3.03e-06   4.07e-06    -0.74   0.457     -.000011    4.96e-06
dist_missions |  -.0086846   .0154561    -0.56   0.574    -.0390217    .0216525
        _cons |  -8.500813   5.335058    -1.59   0.111    -18.97242    1.970796
-------------------------------------------------------------------------------

. 
. 
. * Saving our new data and closing the logfile. 
. 
. save OUTPUT_part2_data, replace
(file OUTPUT_part2_data.dta not found)
file OUTPUT_part2_data.dta saved

. log close
      name:  <unnamed>
       log:  /Users/hst17anwe/Documents/gradstata/Graduate_econ/Lab_2/logfile_la
> b2.log
  log type:  text
 closed on:  13 Nov 2023, 11:15:21
--------------------------------------------------------------------------------
