--------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/hst17anwe/Documents/gradstata/Graduate_econ/Lab_2/logfile_la
> b1.log
  log type:  text
 opened on:  13 Nov 2023, 11:15:23

. 
. 
. * Reading the data and producing some summary statistics.
. use exam_results.dta

. 
. describe

Contains data from exam_results.dta
 Observations:           500                  
    Variables:             8                  10 Nov 2023 17:53
--------------------------------------------------------------------------------
Variable      Storage   Display    Value
    name         type    format    label      Variable label
--------------------------------------------------------------------------------
name            str19   %19s                  
age             float   %9.0g                 
test_score      float   %9.0g                 
hours_studied   float   %9.0g                 
most_lectures   str3    %9s                   
pass            float   %9.0g                 
distinction     float   %9.0g                 
fail            float   %9.0g                 
--------------------------------------------------------------------------------
Sorted by: 

. summarize

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        name |          0
         age |        500      24.436      5.0996         17         56
  test_score |        500       58.13     10.4395         36         89
hours_stud~d |        500      48.506    3.273438         38         56
most_lectu~s |          0
-------------+---------------------------------------------------------
        pass |        500        .714    .4523419          0          1
 distinction |        500        .118    .3229312          0          1
        fail |        500        .168    .3742407          0          1

. * Add some more statistics
. 
. 
. * Plotting test score against hours studied and calculating correlation. 
. scatter test_score hours_studied

. correlate test_score hours_studied
(obs=500)

             | test_s~e hours_~d
-------------+------------------
  test_score |   1.0000
hours_stud~d |  -0.1121   1.0000


. 
. reg test_score hours_studied

      Source |       SS           df       MS      Number of obs   =       500
-------------+----------------------------------   F(1, 498)       =      6.34
       Model |  683.623654         1  683.623654   Prob > F        =    0.0121
    Residual |  53698.9263       498  107.829169   R-squared       =    0.0126
-------------+----------------------------------   Adj R-squared   =    0.0106
       Total |    54382.55       499  108.983066   Root MSE        =    10.384

-------------------------------------------------------------------------------
   test_score | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
hours_studied |  -.3575643   .1420083    -2.52   0.012    -.6365736   -.0785551
        _cons |   75.47402   6.903892    10.93   0.000     61.90967    89.03836
-------------------------------------------------------------------------------

. 
. * Testing our null hypotheses. 
. 
. 
. * Storing the values of the residuals and plotting them against hours studied.
>  
. predict U_hat, residuals

. scatter U_hat hours_studied /* Assumed that he meant hours_studied instead of 
> educ. */

. 
. * Creating categorical variable and re-running the regression with this new va
> riable. 
. 
. * Creating a dummy variable for "most_lectures" and then regressing test score
>  on hours study and this new dummy variable. 
. 
. generate most_lectures_dummy = 1 if most_lectures == "Yes"
(272 missing values generated)

. replace most_lectures_dummy = 0 if missing(most_lectures_dummy)
(272 real changes made)

. 
. reg test_score hours_studied most_lectures_dummy

      Source |       SS           df       MS      Number of obs   =       500
-------------+----------------------------------   F(2, 497)       =     10.98
       Model |  2300.86611         2  1150.43306   Prob > F        =    0.0000
    Residual |  52081.6839       497   104.79212   R-squared       =    0.0423
-------------+----------------------------------   Adj R-squared   =    0.0385
       Total |    54382.55       499  108.983066   Root MSE        =    10.237

-------------------------------------------------------------------------------
   test_score | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------+----------------------------------------------------------------
hours_studied |  -.1526234   .1493984    -1.02   0.307    -.4461537    .1409069
most_lectur~y |   3.853512   .9809197     3.93   0.000     1.926251    5.780773
        _cons |   63.77595   7.428886     8.58   0.000     49.18005    78.37184
-------------------------------------------------------------------------------

. 
. 
. * Saving our new data and closing the logfile. 
. 
. 
. save OUTPUT_part1_data, replace
file OUTPUT_part1_data.dta saved

. log close
      name:  <unnamed>
       log:  /Users/hst17anwe/Documents/gradstata/Graduate_econ/Lab_2/logfile_la
> b1.log
  log type:  text
 closed on:  13 Nov 2023, 11:15:26
--------------------------------------------------------------------------------
